{
  "exercises": [
    {
      "id": "legs-001",
      "name": "سكوات (Squat)",
      "muscle": "legs",
      "equipment": "barbell",
      "difficulty": "intermediate",
      "description": "تمرين مركب أساسي لعضلات الأرجل. قف مع وضع البار على الكتفين، ثم اثنِ ركبتيك كما لو كنت تجلس على كرسي، ثم ارجع للوقوف.",
      "instructions": [
        "قف مع وضع قدميك بعرض الكتفين أو أوسع قليلاً",
        "ضع البار على الجزء العلوي من الظهر (على عضلات التراب)",
        "حافظ على استقامة ظهرك وصدرك مرفوعاً",
        "اثنِ ركبتيك ووركيك للنزول كما لو كنت تجلس على كرسي",
        "انزل حتى تصبح فخذيك موازية للأرض أو أقل قليلاً",
        "ادفع بقدميك على الأرض للعودة إلى وضع الوقوف"
      ],
      "tips": [
        "حافظ على توجيه الركبتين في نفس اتجاه أصابع القدمين",
        "حافظ على وزنك على كعبيك وليس على أصابع قدميك",
        "تنفس بشكل صحيح: خذ نفساً قبل النزول وازفر أثناء الصعود"
      ],
      "image": "squat.jpg"
    },
    {
      "id": "legs-002",
      "name": "ديدليفت (Deadlift)",
      "muscle": "legs",
      "equipment": "barbell",
      "difficulty": "advanced",
      "description": "تمرين مركب يستهدف عضلات الفخذ الخلفية والأرداف والظهر. قف أمام البار، انحنِ وأمسك البار، ثم ارفعه بقوة الأرجل والظهر.",
      "instructions": [
        "قف أمام البار مع وضع قدميك بعرض الكتفين",
        "انحنِ للأمام مع ثني الركبتين وأمسك البار بقبضة متباعدة",
        "ارفع صدرك وثبت ظهرك في وضع مستقيم",
        "ارفع البار عن طريق فرد الركبتين والوركين",
        "قف منتصباً تماماً في نهاية الحركة",
        "أعد البار إلى الأرض بتحكم عن طريق ثني الوركين والركبتين"
      ],
      "tips": [
        "حافظ على استقامة ظهرك طوال التمرين",
        "استخدم قوة الأرجل والوركين وليس الظهر فقط",
        "ابدأ بأوزان خفيفة لإتقان التقنية الصحيحة"
      ],
      "image": "deadlift.jpg"
    },
    {
      "id": "legs-003",
      "name": "لانج (Lunge)",
      "muscle": "legs",
      "equipment": "bodyweight",
      "difficulty": "beginner",
      "description": "تمرين يستهدف عضلات الفخذ الأمامية والخلفية والأرداف. قف منتصباً، ثم اخطُ للأمام واثنِ ركبتيك، ثم عد للوقوف.",
      "instructions": [
        "قف منتصباً مع وضع قدميك بعرض الكتفين",
        "اخطُ للأمام بقدم واحدة مسافة كبيرة",
        "اخفض جسمك عن طريق ثني كلتا الركبتين",
        "توقف عندما تصل الركبة الخلفية قريباً من الأرض",
        "ادفع بالقدم الأمامية للعودة إلى وضع البداية",
        "كرر مع القدم الأخرى"
      ],
      "tips": [
        "حافظ على استقامة ظهرك طوال التمرين",
        "تأكد من أن الركبة الأمامية لا تتجاوز أصابع القدم",
        "للتمرين الأصعب، أضف أوزاناً مثل الدمبل أو البار"
      ],
      "image": "lunge.jpg"
    },
    {
      "id": "legs-004",
      "name": "ليج بريس (Leg Press)",
      "muscle": "legs",
      "equipment": "machine",
      "difficulty": "beginner",
      "description": "تمرين يستهدف عضلات الفخذ الأمامية والأرداف باستخدام جهاز الليج بريس. اجلس على الجهاز، ادفع المنصة بقدميك، ثم أعدها ببطء.",
      "instructions": [
        "اجلس على جهاز الليج بريس مع وضع قدميك على المنصة بعرض الكتفين",
        "حرر مقابض الأمان وأنزل المنصة قليلاً",
        "اثنِ ركبتيك لإنزال المنصة نحوك",
        "توقف عندما تصل ركبتيك إلى زاوية 90 درجة تقريباً",
        "ادفع المنصة بقدميك حتى تمتد ساقيك (مع ترك انثناء طفيف في الركبتين)"
      ],
      "tips": [
        "لا تثنِ ركبتيك بشكل مفرط لتجنب الإصابة",
        "حافظ على ضغط أسفل الظهر على المقعد",
        "يمكن تغيير وضع القدمين لاستهداف عضلات مختلفة"
      ],
      "image": "leg-press.jpg"
    },
    {
      "id": "legs-005",
      "name": "ليج إكستنشن (Leg Extension)",
      "muscle": "legs",
      "equipment": "machine",
      "difficulty": "beginner",
      "description": "تمرين عزل لعضلات الفخذ الأمامية. اجلس على جهاز الليج إكستنشن، ثم ارفع ساقيك للأمام عن طريق مد الركبتين.",
      "instructions": [
        "اجلس على جهاز الليج إكستنشن مع وضع ظهرك على المسند",
        "ضع قدميك تحت البكرة المبطنة",
        "أمسك المقابض الجانبية للثبات",
        "ارفع ساقيك للأمام عن طريق مد الركبتين بالكامل",
        "اضغط على عضلات الفخذ الأمامية في نهاية الحركة",
        "أعد ساقيك ببطء إلى وضع البداية"
      ],
      "tips": [
        "تجنب رفع الوركين عن المقعد",
        "لا ترفع وزناً ثقيلاً جداً لتجنب الضغط على الركبتين",
        "ركز على الضغط بعضلات الفخذ الأمامية طوال التمرين"
      ],
      "image": "leg-extension.jpg"
    },
    {
      "id": "legs-006",
      "name": "ليج كيرل (Leg Curl)",
      "muscle": "legs",
      "equipment": "machine",
      "difficulty": "beginner",
      "description": "تمرين عزل لعضلات الفخذ الخلفية. استلقِ على جهاز الليج كيرل، ثم اثنِ ركبتيك لرفع البكرة المبطنة.",
      "instructions": [
        "استلقِ على جهاز الليج كيرل مع وضع وجهك لأسفل",
        "ضع كاحليك تحت البكرة المبطنة",
        "أمسك المقابض للثبات",
        "ارفع البكرة عن طريق ثني ركبتيك نحو أردافك",
        "اضغط على عضلات الفخذ الخلفية في نهاية الحركة",
        "أعد ساقيك ببطء إلى وضع البداية"
      ],
      "tips": [
        "تجنب رفع الوركين عن المقعد",
        "ركز على استخدام عضلات الفخذ الخلفية فقط",
        "تحكم في الحركة أثناء العودة إلى وضع البداية"
      ],
      "image": "leg-curl.jpg"
    }
  ]
}
